/**
 * TODO
 * лимиты  заменить на % шанс генерации
 */

/**
 * Конфигурация генерируемых рун
 * @type {Array}
 * @example
 * limit: 20,                 // лимит руны на полк в %
 * region: {                  // допустимый регион для генерации
 *   start: { i: 0, j: 0 },   // координаты начала региона в %
 *   end: { i: 100, j: 100 }, // координаты конца региона в %
 * }
 */
module.exports = [
  { // красный
    limit: 20,
    region: {
      start: { i: 0, j: 0 },
      end: { i: 100, j: 100 },
    },
  },
  { // фиолетовый
    limit: 20,
    region: {
      start: { i: 0, j: 0 },
      end: { i: 100, j: 100 },
    },
  },
  { // зеленый
    limit: 28,
    region: {
      start: { i: 0, j: 0 },
      end: { i: 100, j: 100 },
    },
  },
  { // желтый
    limit: 28,
    region: {
      start: { i: 0, j: 0 },
      end: { i: 100, j: 100 },
    },
  },
  { // синий
    limit: 28,
    region: {
      start: { i: 0, j: 0 },
      end: { i: 100, j: 100 },
    },
  },
  { // радуга
    limit: 3,
    region: {
      start: { i: 20, j: 20 },
      end: { i: 80, j: 100 },
    },
  },
];
